/*Задание 2.1
Необходимо реализовать строение классов, без конкретной реализации!

Необходимо реализовать:
Интерфейс QueueBehaviour, который описывает логику очереди – помещение в/освобождение из
очереди, принятие/отдача заказа
 */

package HW_2.HW_2_2;

public interface QueueBehaviour {
    void enqueue(Person person); // Добавление человека в очередь
    Person dequeue(); // Удаление человека из очереди
    boolean isEmpty(); // Проверка на пустоту очереди
    int size(); // Получение размера очереди
    }