/*Задание 2.1
Необходимо реализовать строение классов, без конкретной реализации!

Необходимо реализовать:
Интерфейс QueueBehaviour, который описывает логику очереди – помещение в/освобождение из
очереди, принятие/отдача заказа
 */

package HW_2;

public interface QueueBehaviour {
    void takeInQueue(Actor actor);//метод для помещения клиента в очередь
    void takeOrders(); // метод по принятию заказа от покупателя
    void giveOrders();// метод по передаче заказа покупателю, т.е. клиент получил заказ
    void releaseFromQueue();  // метод для ПОДГОТОВКИ клиента на выход из магазина
}
